tap "bufbuild/buf"
tap "hashicorp/tap"
tap "osx-cross/avr"
tap "sudar/arduino-mk"
tap "yoheimuta/protolint"
# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Arduino command-line interface
brew "arduino-cli"
# Collection of portable C++ source libraries
brew "boost"
# Standard XML representation system for technical documents
brew "docbook"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# C string library for manipulating Unicode strings
brew "libunistring"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Callback framework for C++
brew "libsigc++"
# C++ interface to glib
brew "glibmm"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm@2.28"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for USB device access
brew "libusb"
# Library for USB device access
brew "libusb-compat"
# Atmel AVR MCU programmer
brew "avrdude"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Small proxy between HTTP client and AWS Elasticsearch
brew "aws-es-proxy"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Garbage collector for C and C++
brew "bdw-gc"
# C++ build system
brew "boost-build"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Vector graphics library with cross-device output support
brew "cairo"
# Vector graphics library with cross-device output support
brew "cairomm"
# Vector graphics library with cross-device output support
brew "cairomm@1.14"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Asynchronous event library
brew "libevent"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt", link: true
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# New GNU portable threads library
brew "npth"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.24"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GitHub Markdown previewer
brew "grip"
# Like cURL, but for gRPC
brew "grpcurl"
# Numerical library for C and C++
brew "gsl"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# C++ interface to Pango
brew "pangomm@2.46"
# C++ interfaces for GTK+ and GNOME
brew "gtkmm"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# GNU utilities for networking
brew "inetutils"
# String tool
brew "intltool"
# Istio configuration command-line utility
brew "istioctl"
# Image manipulation library
brew "jpeg"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Portable Foreign Function Interface library
brew "libffi"
# C library implementing the SSH2 protocol
brew "libssh2"
# YAML Parser
brew "libyaml"
# Utility for directing compilation
brew "make"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Programs for dealing with numbers from the command-line
brew "num-utils"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Parchive: Parity Archive Volume Set for data recovery
brew "par2"
# Highly capable, feature-rich programming language
brew "perl"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Protoc plugin that generates code for gRPC-Web clients
brew "protoc-gen-grpc-web"
# GNU Portable THreads
brew "pth"
# Python implementation of Markdown
brew "python-markdown"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# QR Code generation
brew "qrencode"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Advanced console-based IP subnet calculator
brew "sipcalc"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol
brew "telnet", link: false
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Electronics prototyping platform
cask "arduino-ide"
# Menu bar icon organiser
cask "bartender"
# FTP File Transfer Software
cask "classicftp"
# Terminal-based AI coding assistant
cask "claude-code"
# Menu bar timezone tracker and compact calendar
cask "clocker"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Regular expressions manager app
cask "expressions"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Open-source video transcoder
cask "handbrake-app"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# App to manage software development and track bugs
cask "linear"
# Open-source Markdown editor
cask "macdown"
# Native app email client for Gmail
cask "mimestream"
# Sandbox construction video game
cask "minecraft"
# CSV editor
cask "modern-csv"
# Database administration and development tool for PostgreSQL
cask "navicat-for-postgresql"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Programmable solid 3D CAD modeller
cask "openscad"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Multimedia player
cask "vlc"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Cross platform gRPC client
cask "wombat"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/cmd/gomvpkg"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
