tap "bufbuild/buf"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "ack"
brew "adns"
brew "apr"
brew "apr-util"
brew "icu4c"
brew "boost"
brew "docbook"
brew "gdbm"
brew "asciidoc"
brew "libffi"
brew "glib"
brew "atk"
brew "libsigc++"
brew "glibmm"
brew "atkmm"
brew "autoconf"
brew "automake"
brew "aws-es-proxy"
brew "aws-iam-authenticator"
brew "awscli"
brew "bdw-gc"
brew "boost-build"
brew "libpng"
brew "freetype"
brew "pkg-config"
brew "cairo"
brew "cairomm"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "go"
brew "dep"
brew "docker-completion"
brew "dos2unix"
brew "doxygen"
brew "jpeg"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "libtool"
brew "libunistring"
brew "guile"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "gnupg", link: false
brew "gobject-introspection"
brew "graphite2"
brew "grpcurl"
brew "gsl"
brew "harfbuzz"
brew "hicolor-icon-theme"
brew "gtk+"
brew "gtkmm"
brew "helm"
brew "htop"
brew "hugo"
brew "intltool"
brew "istioctl"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli", link: false
brew "libssh2"
brew "libusb-compat"
brew "libyaml"
brew "little-cms"
brew "little-cms2"
brew "make"
brew "nghttp2"
brew "nmap"
brew "node"
brew "num-utils"
brew "nvm"
brew "ossp-uuid"
brew "par2"
brew "perl"
brew "postgresql"
brew "protobuf"
brew "protoc-gen-go"
brew "pth"
brew "python@3.8"
brew "reattach-to-user-namespace"
brew "rename"
brew "ruby"
brew "utf8proc"
brew "subversion"
brew "tig"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "zlib"
brew "bufbuild/buf/buf"
brew "hashicorp/tap/terraform"
cask "1password"
cask "alacritty"
cask "alfred"
cask "arduino"
cask "clocker"
cask "discord"
cask "expressions"
cask "firefox"
cask "google-drive"
cask "imageoptim"
cask "macdown"
cask "notion"
cask "obs"
cask "obs-virtualcam"
cask "slack"
cask "steam"
cask "wkhtmltopdf"
