tap "bufbuild/buf"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "osx-cross/avr"
tap "sudar/arduino-mk"
tap "yoheimuta/protolint"
brew "ack"
brew "adns"
brew "libpng"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "arduino-cli"
brew "boost"
brew "docbook"
brew "gdbm"
brew "python@3.10"
brew "asciidoc"
brew "glib"
brew "atk"
brew "libsigc++"
brew "glibmm"
brew "atkmm"
brew "atkmm@2.28"
brew "autoconf"
brew "automake"
brew "libusb"
brew "libusb-compat"
brew "avrdude"
brew "node"
brew "aws-cdk"
brew "aws-es-proxy"
brew "aws-iam-authenticator"
brew "python@3.11"
brew "docutils"
brew "awscli"
brew "bdw-gc"
brew "boost-build"
brew "freetype"
brew "pkg-config"
brew "cairo"
brew "cairomm"
brew "gmp"
brew "coreutils"
brew "libevent"
brew "libunistring"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cmake"
brew "cmake-docs"
brew "cscope"
brew "ctags"
brew "go"
brew "dos2unix"
brew "doxygen"
brew "findutils"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "glide"
brew "gnu-sed"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "gnupg"
brew "gobject-introspection"
brew "golangci-lint"
brew "graphite2"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "grip"
brew "grpcurl"
brew "gsl"
brew "hicolor-icon-theme"
brew "gtk+"
brew "pangomm@2.46"
brew "gtkmm"
brew "guile"
brew "htop"
brew "hugo"
brew "inetutils", link: false
brew "intltool"
brew "istioctl"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli"
brew "libffi"
brew "libssh2"
brew "libyaml"
brew "make"
brew "nghttp2"
brew "nmap"
brew "num-utils"
brew "nvm"
brew "openjdk"
brew "ossp-uuid"
brew "packer"
brew "pandoc"
brew "par2"
brew "perl"
brew "platformio"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "protoc-gen-grpc-web"
brew "pth"
brew "python@3.8"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "sipcalc"
brew "utf8proc"
brew "subversion"
brew "telnet"
brew "tig"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "yarn"
brew "yq"
brew "zlib"
brew "zsh"
brew "bufbuild/buf/buf"
brew "hashicorp/tap/terraform"
brew "osx-cross/avr/avr-gcc@9"
brew "sudar/arduino-mk/arduino-mk"
brew "yoheimuta/protolint/protolint"
cask "1password"
cask "alacritty"
cask "alfred"
cask "arduino"
cask "bartender"
cask "basictex"
cask "classicftp"
cask "clocker"
cask "cyberduck"
cask "discord"
cask "docker"
cask "expressions"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "linear-linear"
cask "macdown"
cask "mimestream"
cask "minecraft"
cask "modern-csv"
cask "navicat-for-postgresql"
cask "notion"
cask "obs"
cask "obs-virtualcam"
cask "openscad"
cask "slack"
cask "steam"
cask "vlc"
cask "wifi-explorer"
cask "wkhtmltopdf"
cask "wombat"
